<!-- Personal Modal -->
<div class="modal fade" id="personalModal" tabindex="-1" aria-labelledby="personalModal" aria-hidden="true">
   <div class="modal-dialog modal-dialog-centered modal-dialog-scrollable modal-xl">
      <div class="modal-content">
         <div class="modal-header">
            <h4 class="modal-title font-thai fw-bold" id="personalModal">
               นโยบายความเป็นส่วนตัวการใช้งานเว็บไซต์
            </h4>
            <button type="button" class="btn" data-bs-toggle="modal" data-bs-target="#confirmModal">
               <i class="fas fa-chevron-left"></i>
            </button>
         </div>
         <div class="modal-body">
            <div class="row overflow-auto" style="height: 65vh">
               <div class="col-12">
                  <p class="font-thai">
                     เว็บไซต์นี้ดำเนินการโดย บริษัท เอส เอ็น ซี ฟอร์เมอร์ จำกัด (มหาชน) และบริษัทในเครือ
                     (ซึ่งต่อไปนี้เรียกว่า "บริษัท" "เรา") โดยที่ผู้มาติดต่อ หรือบุคคลใดก็ตามที่เข้ามาใช้งานเว็บไซต์นี้
                     (ซึ่งจะรวมเรียกว่า “ท่าน”)
                     การที่ท่านเข้าใช้งานเว็บไซต์ถือว่าท่านตกลงอย่างชัดแจ้งที่จะผูกพันและปฏิบัติตามข้อกำหนดและเงื่อนไข
                     และประกาศต่าง ๆ ที่ระบุไว้ในเว็บไซต์ ซึ่งถือเป็นสัญญาระหว่างท่านกับเราแล้ว
                     โดยท่านยืนยันว่าท่านเป็นผู้ที่บรรลุนิติภาวะหรือเป็นผู้เยาว์ที่ผู้ใช้อำนาจปกครอง
                     ได้อ่านข้อกำหนดและตกลงยินยามตามเงื่อนไขในนโยบายความเป็นส่วนตัวในการใช้งานเว็บไซต์นี้เรียบร้อยแล้ว
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">1. สิทธิของเรา</b><br />
                     1.1 เราเป็นเจ้าของข้อมูลและลิขสิทธิ์ เครื่องหมายการค้า สัญลักษณ์ เครื่องหมายบริการ และชื่อทางการค้า
                     ไม่ว่าจดทะเบียนหรือไม่ได้จดทะเบียน ที่ปรากฏอยู่ในเว็บไซต์นี้ และส่วนประกอบอื่น ๆ ของเว็บไซต์
                     เราไม่อนุญาตหรือยินยอมให้มีการใช้ข้อมูลและลิขสิทธิ์ เครื่องหมายการค้า สัญลักษณ์ เครื่องหมายบริการ
                     และชื่อทางการค้าดังกล่าวโดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรจากเรา
                     หรือตามที่กำหนดไว้ในเว็บไซต์นี้
                     <br />1.2
                     เราเป็นเจ้าของและเป็นผู้มีสิทธิแต่เพียงผู้เดียวในข้อมูลทั้งหมดที่ปรากฏบนเว็บไซต์นี้ไม่ว่าจะอยู่ในรูปแบบใด
                     เว้นแต่จะกำหนดเป็นอย่างอื่นในข้อกำหนดและเงื่อนไขการใช้เว็บไซต์หรือเอกสารอื่น ๆ ที่เกี่ยวข้อง
                     ข้อมูลทั้งหมดได้รับความคุ้มครองตามกฎหมาย ท่านตกลงจะไม่คัดลอก ดาวน์โหลด สั่งพิมพ์ และ/หรือ
                     ใช้ข้อมูลในเว็บไซต์นี้เว้นแต่ได้รับอนุญาตจากเราโดยชัดแจ้ง ทั้งนี้
                     ข้อมูลส่วนบุคคลของท่านไม่อยู่ในบังคับของข้อนี้และจะใช้บังคับตามนโยบายความเป็นส่วนตัว
                     <br />1.3 ท่านตกลงจะไม่ ทำซ้ำ ดัดแปลง ปรับปรุง แก้ไข ต่อเติม เรียบเรียงใหม่ หรือวิศวกรรมย้อนกลับ
                     (Reverse Engineering) เว็บไซต์ ไม่ว่ากรณีใด ๆ ก็ตาม และจะไม่ลบ ทำลาย ทำให้เสียหาย
                     หรือทำให้ไม่ชัดเจนซึ่งเครื่องหมายหรือสัญลักษณ์แสดงความเป็นเจ้าของลิขสิทธิ์หรือเครื่องหมายการค้าหรือบริการของบริษัทไม่ว่าจะโดยจงใจหรือประมาทเลินเล่อก็ตาม
                     ทั้งนี้ ท่านตกลงจะไม่แต่งตั้งให้บุคคลภายนอกกระทำการตามข้อนี้
                     <br />1.4 ข้อมูลที่ปรากฏในเว็บไซต์นี้ อาจไม่ถูกต้อง ไม่สมบูรณ์
                     หรือไม่ตรงตามข้อเท็จจริงหรือไม่เป็นปัจจุบัน ท่านไม่ควรตัดสินใจดำเนินการใด ๆ
                     โดยยึดถือตามข้อมูลที่ปรากฏในเว็บไซต์นี้แต่เพียงอย่างเดียว
                     การใช้ข้อมูลในเว็บไซต์นี้เป็นความเสี่ยงของตัวท่านเอง โดยเราจะไม่รับผิดชอบใด ๆ ในความสูญเสีย เสียหาย
                     หรือค่าใช้จ่ายใด ๆ ที่เกิดขึ้นจากการที่ท่านใช้ข้อมูลที่ได้รับจากเว็บไซต์นี้ และ
                     เรามีสิทธิที่จะปรับปรุง เปลี่ยนแปลงข้อมูลที่อยู่ในเว็บไซต์ได้ตลอดเวลาโดยเป็นดุลพินิจของ
                     เราแต่เพียงผู้เดียว
                     <br />1.5 ท่านตกลงที่จะไม่รบกวนการทำงานของเว็บไซต์ไม่ว่าด้วยวิธีการใด รวมถึงจะไม่กระทำการใด ๆ
                     ที่ขัดหรือแย้งกับนโยบายข้อกำหนดและเงื่อนไขของเรา
                     ไม่กระทำผิดกฎหมายหรือทำสิ่งใดที่ขัดต่อความสงบเรียบร้อยหรือศีลธรรมอันดีของประชาชน
                     เราสงวนสิทธิที่จะจำกัดหรือระงับการใช้งานของท่านในเวลาใด ๆ ไม่ว่าทั้งหมดหรือบางส่วน
                     รวมถึงการกระทำอื่นใด ๆ เพื่อหยุดการกระทำของท่านโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                     ทั้งนี้การระงับการใช้งานไม่ถือเป็นการสละสิทธิหรือมาตรการใด ๆ ที่ เรามีอยู่ตามกฎหมาย
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">2. ข้อมูลที่ท่านให้ไว้ในเว็บไซต์</b><br />
                     ท่านรับรองและรับประกันว่าท่านเป็นเจ้าของหรือเป็นผู้มีสิทธิในข้อมูลที่ตนเองให้ไว้
                     และข้อมูลเหล่านั้นสมบูรณ์ ถูกต้อง ตรงความเป็นจริง มีความเหมาะสม ชอบด้วยกฎหมาย
                     ไม่ละเมิดข้อกำหนดการใช้งานใด ๆ ในเว็บไซต์นี้ รวมถึงไม่เป็นการแอบอ้างเป็นบุคคลอื่น
                     และจะไม่ก่อให้เกิดความเสียหายต่อบุคคลใด ๆ
                     และท่านตกลงจะรับผิดในความเสียหายที่เกิดแก่เราและ/หรือบุคคลอื่นตามจำนวนที่เกิดขึ้นจริงในกรณีที่ท่านไม่ปฏิบัติตามข้อนี้ท่าน
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">3. ข้อมูลส่วนบุคคลและการใช้ข้อมูล</b><br />
                     ในการให้บริการตามวัตถุประสงค์ของเว็บไซต์ เราอาจมีการเก็บรวบรวม ใช้
                     และในบางกรณีอาจเปิดเผยข้อมูลของท่านเพื่อการให้บริการแก่ท่านหรือเพื่อประโยชน์ในการบริการของเราหรือบริษัทอื่นที่ดำเนินธุรกิจร่วมกับเรา
                     อย่างไรก็ดี เราให้ความสำคัญกับสิทธิความเป็นส่วนตัวของท่าน ดังนั้น
                     ในกรณีที่ข้อมูลนั้นเป็นข้อมูลส่วนบุคคลของท่าน
                     เราจะดำเนินการตามที่กำหนดในข้อนี้ต่อเมื่อได้รับความยินยอมจากท่านหรือเมื่อเราสามารถทำได้ตามกฎหมายเท่านั้น
                     ทั้งนี้ รายละเอียดต่าง ๆ เกี่ยวกับการเก็บรวบรวม ใช้ เปิดเผย
                     และประมวลข้อมูลส่วนบุคคลเป็นไปตามนโยบายความเป็นส่วนตัว
                     ซึ่งต้องให้ความยินยอมแยกต่างหากจากข้อกำหนดฉบับนี้
                     โดยท่านสามารถดูรายละเอียดเกี่ยวกับการประมวลผลข้อมูลส่วนบุคคลได้ที่นโยบายความเป็นส่วนตัวของเรา
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">4. การปรับปรุงแก้ไข เปลี่ยนแปลง หรือหยุดการให้บริการเว็บไซต์</b><br />
                     ท่านเข้าใจและยอมรับว่า เรามีสิทธิที่จะปรับปรุง แก้ไข เปลี่ยนแปลง หรือหยุดการให้บริการส่วนใด ๆ
                     ของเว็บไซต์ ไม่ว่าจะเป็นรูปแบบการให้บริการ ระบบการทำงาน การแสดงผล และหรือข้อมูลใด ๆ
                     ที่ปรากฏอยู่บนเว็บไซต์ การที่ท่านตกลงดาวน์โหลด หรือใช้บริการเว็บไซต์หลังจากที่เราได้ทำการปรับปรุง
                     แก้ไข หรือเปลี่ยนแปลงแล้ว ถือว่าท่านได้ให้ความยินยอมโดยชัดแจ้งแก่เราในการติดตั้ง อัปเกรดและ/หรือ
                     อัปเดต การปรับปรุง แก้ไข เปลี่ยนแปลง หรือหยุดการให้บริการดังกล่าว
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">5. การปรับปรุงแก้ไข หรือเปลี่ยนแปลงข้อกำหนดและเงื่อนไข</b><br />
                     5.1 ท่านเข้าใจและยอมรับว่า เรามีสิทธิที่จะปรับปรุงแก้ไข
                     หรือเปลี่ยนแปลงข้อกำหนดและเงื่อนไขนี้โดยไม่แจ้งล่วงหน้า
                     โดยเราจะประกาศข้อกำหนดและเงื่อนไขที่ปรับปรุงแก้ไขหรือเปลี่ยนแปลงบนเว็บไซต์ให้ท่านได้พิจารณาก่อนการเข้าใช้งานเว็บไซต์
                     พร้อมระบุวันที่แก้ไขเพิ่มเติมครั้งล่าสุด
                     การที่ท่านใช้บริการทางเว็บไซต์ของเราต่อไปหลังจากที่มีการปรับปรุงแก้ไข
                     หรือเปลี่ยนแปลงข้อกำหนดและเงื่อนไขแล้ว จะถือว่าท่านยอมรับข้อกำหนดและเงื่อนไขที่ปรับปรุงแก้ไข
                     หรือเปลี่ยนแปลงนั้นแล้วโดยชัดแจ้ง
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">6. ข้อสงวนสิทธิ</b><br />
                     6.1 ท่านรับรู้ว่าประสิทธิภาพในการใช้งานเว็บไซต์ขึ้นอยู่กับประสิทธิภาพของอินเทอร์เน็ต
                     และสภาพอุปกรณ์ของท่านที่ใช้ในการเข้าถึงเว็บไซต์ด้วย
                     <br />6.2 ท่านยอมรับและเข้าใจว่าข้อมูลใด ๆ ที่ท่านได้รับจากการใช้เว็บไซต์นี้อาจไม่เหมาะสม แม่นยำ
                     สมบูรณ์ และ/หรือ เชื่อถือได้ และเราไม่มีหน้าที่รับผิดชอบใด ๆ ในความสูญเสีย เสียหาย หรือค่าใช้จ่ายใด
                     ๆ ที่เกิดขึ้นจากการที่ท่านใช้ข้อมูลที่ได้รับจากเว็บไซต์นี้
                     <br />6.3 ในการใช้งานเว็บไซต์หรือกรณีที่ท่านดาวน์โหลดข้อมูลและส่วนประกอบใด ๆ จากเว็บไซต์
                     ข้อมูลและส่วนประกอบดังกล่าวอาจไม่ถูกต้องสมบูรณ์ เพียงพอ เป็นปัจจุบัน เหมาะสม เชื่อถือได้
                     หรือปราศจากไวรัส, SPYWARE, MALWARE, COMPUTER WORM, TROJAN การเข้าเว็บไซต์นี้อาจจะไม่ต่อเนื่อง
                     มีความผิดพลาด ล่าช้า ไม่ถูกต้องครบถ้วน หรือไม่สามารถเข้าถึงระบบหรือข้อมูลในเว็บไซต์นี้ได้
                     ท่านตกลงรับความเสี่ยงภัยในความสูญหาย เสียหาย ค่าใช้จ่ายที่เกิดขึ้นต่อระบบคอมพิวเตอร์ สื่อกลาง
                     หรือเครื่องมือสื่อสาร หรือเครื่องมือและอุปกรณ์ใด ๆ ที่ใช้ในการเข้าถึงเว็บไซต์นี้
                     รวมตลอดถึงการสูญหายของข้อมูล
                     รวมทั้งความเสียหายโดยอ้อมซึ่งเป็นผลมาจากการใช้งานเว็บไซต์หรือดาวน์โหลดข้อมูลและส่วนประกอบจากเว็บไซต์
                     และท่านตกลงที่จะไม่เรียกร้องให้เรารับผิดใด ๆ
                     ในความขัดข้องของเว็บไซต์ที่ไม่ได้เกิดจากการกระทำโดยจงใจของเรา
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">7.การละเว้นการใช้สิทธิ</b><br />
                     การละเว้นไม่ใช้สิทธิ และ/หรือการผ่อนผันการใช้สิทธิไม่ว่าส่วนหนึ่งส่วนใดของเรา
                     ไม่ถือว่าเราสละสิทธิตามข้อตกลงหรือเงื่อนไขข้อนั้น ๆ
                     เรายังคงสงวนสิทธิที่จะเลือกใช้สิทธิตามข้อดังกล่าวได้ต่อไป
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">8. การขัดกันของเอกสาร</b><br />
                     ในกรณีที่ข้อความในข้อกำหนดและเงื่อนไขฉบับนี้และเอกสารอื่น ๆ ขัดแย้งกัน
                     คู่สัญญาตกลงให้เป็นดุลพินิจของเราในการตีความ
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">9. กฎหมายที่ใช้บังคับ</b><br />
                     การใช้บริการเว็บไซต์เป็นไปตามบังคับของกฎหมายไทย
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">10. รายละเอียดการติดต่อเรา</b><br />
                     หากท่านมีข้อซักถามหรือข้อสงสัยประการใด หรือมีความประสงค์ที่จะสิทธิของท่านเกี่ยวกับข้อมูลระบบ CCTV
                     โปรดติดต่อเราหรือเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเรา ที่
                     <br />
                     <br />
                     บริษัท เอส เอ็น ซี ฟอร์เมอร์ จำกัด (มหาชน)(สำนักงานใหญ่)<br />
                     333/3 หมู่ที่ 6 ตำบลบางเพรียง อำเภอบางบ่อ จังหวัดสมุทรปราการ 10560
                     Tel. (662) 108-0370 – 76 , E-mail : snc@sncformer.com
                     <br />
                     <br />
                     เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล<br />
                     คุณพรชัย ศิริกิจพาณิชย์กูล<br />
                     333/3 หมู่ที่ 6 ตำบลบางเพรียง อำเภอบางบ่อ จังหวัดสมุทรปราการ 10560
                     Tel. (662) 108-0370 – 76 , E-mail : Pornchai@sncformer.com
                  </p>
               </div>
            </div>
         </div>
      </div>
   </div>
</div>

<!-- CCTV Modal -->
<div class="modal fade" id="CCTVModal" tabindex="-1" aria-labelledby="CCTVModal" aria-hidden="true">
   <div class="modal-dialog modal-dialog-centered modal-dialog-scrollable modal-xl">
      <div class="modal-content">
         <div class="modal-header">
            <h4 class="modal-title font-thai fw-bold" id="CCTVModal">นโยบายความเป็นส่วนตัวในการใช้งานกล้องวงจรปิด (CCTV)
            </h4>
            <button type="button" class="btn" data-bs-toggle="modal" data-bs-target="#confirmModal">
               <i class="fas fa-chevron-left"></i>
            </button>
         </div>
         <div class="modal-body">
            <div class="row overflow-auto" style="height: 65vh">
               <!-- <div class="col-12 pt-1">
                  <p class="font-thai">ฉบับลงวันที่ XX XX XXXX</p>
               </div> -->
               <div class="col-12 pt-1">
                  <p class="font-thai">
                     นโยบายความเป็นส่วนตัวฉบับนี้ (“นโยบาย”) จะอธิบายเกี่ยวกับการใช้อุปกรณ์กล้องวงจรปิด (“CCTV”)
                     ที่บริษัท เอส เอ็น ซี ฟอร์เมอร์ จำกัด (มหาชน)และบริษัทในเครือ (ซึ่งต่อไปนี้เรียกว่า "บริษัท" "เรา"
                     หรือ "ของเรา") ได้ใช้อุปกรณ์ CCTV พร้อมกับระบบต่างๆ สำหรับการตรวจสอบภายในพื้นที่ใดเป็นการเฉพาะ
                     รวมถึงพื้นที่รอบๆ บริเวณของสถานที่ อาคาร และพื้นที่ใดๆ เพื่อการป้องกันชีวิต อนามัย และทรัพย์สิน
                     โดยมีข้อมูลส่วนบุคคลของลูกจ้าง กรรมการบริษัท คู่ค้า ผู้ปฏิบัติงาน ผู้มาติดต่อ หรือบุคคลใดก็ตาม
                     (ซึ่งจะรวมเรียกว่า “ท่าน” หรือ “ของท่าน)
                     ที่ได้เข้าไปอยู่ในบริเวณพื้นที่ที่ทำการตรวจสอบภายในอาคารและพื้นที่ใดๆ ดังกล่าว นอกจากนี้
                     นโยบายฉบับนี้อธิบายถึงวิธีการในการเก็บรวบรวม ใช้ เปิดเผย
                     และการส่งหรือโอนย้ายข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ (“ข้อมูลส่วนบุคคล”)
                     ของท่าน และระบุถึงวิธีการในการจัดการหรือการใช้ระบบ CCTV ของเรา ทั้งนี้
                     เราอาจทำการแก้ไขเพิ่มเติมนโยบายฉบับนี้ได้ทุกเมื่อและจะแจ้งถึงการแก้ไขดังกล่าวให้ท่านได้ทราบเท่าที่จะดำเนินการได้
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">1. ข้อมูลส่วนบุคคลประเภทใดบ้างที่เราเก็บรวบรวม</b><br />
                     เราจะทำการเก็บภาพเคลื่อนไหวหรือภาพนิ่งซึ่งสามารถที่จะสามารถจดจำได้ว่าเป็นท่าน เสียงของท่าน
                     รวมถึงทรัพย์สินของท่าน อาทิ ยานพาหนะ เมื่อเข้าไปในพื้นที่ที่ได้ทำการตรวจสอบภายในสถานที่ อาคาร
                     และพื้นที่ใดๆ ของเรา ผ่านระบบและอุปกรณ์ CCTV (“ข้อมูลจาก CCTV”)
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">2. เหตุใดเราจึงเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน</b><br />
                     2.1 เราอาจทำการรวบรวม เก็บภาพ ใช้ เปิดเผย โอน และดำเนินการใดๆ
                     ซึ่งรวมถึงแต่ไม่จำกัดเพียงการบันทึกการเก็บบันทึก การปรับเปลี่ยน การแก้ไข การดัดแปลง การทำลาย การลบ
                     การกู้คืน การรวม การทำสำเนา การส่งผ่าน การเก็บรักษา การถอน การปรับปรุง การเพิ่มเติม ต่อข้อมูลจาก
                     CCTV เกี่ยวกับท่านและข้อมูลส่วนบุคคลอื่นๆ ที่เกี่ยวข้องกับท่าน สำหรับ "วัตถุประสงค์การตรวจสอบโดย
                     CCTV" ตามรายการที่ระบุไว้ด้านล่าง จะกระทำบนฐานประโยชน์โดยชอบด้วยกฎหมาย เพื่อประโยชน์ต่อชีวิต
                     เพื่อการปฏิบัติตามกฎหมาย เพื่อประโยชน์สาธารณะ ตามความยินยอมที่ได้รับ
                     หรือตามฐานอื่นใดที่ได้รับอนุญาตตามกฎหมายที่บังคับใช้ในประเทศไทย
                     (โดยที่ผลประโยชน์เหล่านั้นจะไม่เป็นการก้าวล่วงต่อสิทธิและผลประโชน์ของบุคคลใด)
                     ซึ่งอาจพิจารณาได้ตามกรณีดังนี้
                     <br />
                     • เพื่อปกป้องชีวิต ร่างกาย ความปลอดภัยอนามัยส่วนบุคคล และ/หรือทรัพย์สินส่วนตัวของท่าน
                     <br />
                     • เพื่อควบคุมการเข้ามาภายในอาคารและเพื่อการรักษาความปลอดภัยของอาคาร บุคลากร พนักงาน และผู้มาติดต่อ
                     รวมทั้งทรัพย์สินและข้อมูล ของเราที่ตั้งอยู่หรือเก็บไว้ในสถานที่นั้นๆ
                     <br />
                     • เพื่อการปกป้อง/ป้องกันสถานที่ อาคาร พื้นที่ต่างๆ และทรัพย์สินของเรา จากความเสียหาย การหยุดชะงัก
                     การทำลาย และอาชญากรรมอื่นๆ
                     <br />
                     •
                     เพื่อช่วยเหลือในการแก้ไขปัญหาข้อพิพาทอย่างมีประสิทธิภาพที่เกิดขึ้นในขณะทำการลงโทษทางวินัยหรือการพิจารณาเรื่องร้องทุกข์
                     <br />
                     • เพื่อช่วยเหลือในการสืบสวนสอบสวนหรือการดำเนินการเกี่ยวกับการร้องเรียน และการแจ้งเบาะแส
                     <br />
                     • เพื่อนำไปใช้ในการพิสูจน์หรือหักล้างในการดำเนินคดีทางแพ่ง
                     ซึ่งรวมถึงแต่ไม่จำกัดเพียงการดำเนินกระบวนพิจารณาคดีแรงงาน
                     <br />
                     • เพื่อปฏิบัติตามหน้าที่ตามกฎหมายของเรา และ/หรือ การให้ความร่วมมือกับศาล หน่วยงานกำกับดูแล
                     หน่วยงานของรัฐ และหน่วยงานที่มีอำนาจบังคับใช้กฎหมาย สำหรับการใช้อำนาจหน้าที่ตามกฎหมาย
                     ซึ่งรวมถึงแต่ไม่จำกัดเพียงเพื่อความปลอดภัย อาชีวอนามัยและสภาพแวดล้อมในการทำงาน
                     พวกเราเล็งเห็นว่าการใช้ระบบ CCTV
                     เป็นมาตรการที่จำเป็นเพื่อให้เราสามารถปฏิบัติตามภาระหน้าที่เหล่านั้นได้
                     <br />
                     • เพื่อการใช้สิทธิของเราหรือปกป้องผลประโยชน์โดยชอบด้วยกฎหมายของเราในกรณีที่จำเป็นต้องทำเช่นนั้น
                     เพื่อระงับยับยั้ง ป้องกันและตรวจจับการประพฤติมิชอบ อาชญากรรมหรือการฝ่าฝืนกฎหมาย ติดตามเหตุการณ์
                     เพื่อป้องกันและรายงานการประพฤติมิชอบหรืออาชญากรรมในร้านค้าของเราและเพื่อปกป้องความปลอดภัยและความมั่นคงของธุรกิจของเรา
                     พวกเราจะพยายามอย่างต่อเนื่องเพื่อสร้างสมดุลระหว่างผลประโยชน์โดยชอบด้วยกฎหมายของเราและของบุคคลที่สาม
                     และสิทธิขั้นพื้นฐานและเสรีภาพของท่านที่เกี่ยวข้องกับการปกป้องข้อมูลบนระบบ CCTV ที่เกี่ยวข้องกับท่าน
                     ตามแต่กรณี เราจะพยายามระบุถึงขั้นตอนที่จำเป็นเพื่อให้เกิดความสมดุลที่เหมาะตามแต่สมควร
                     <br />
                     2.2 เราจะติดตั้งอุปกรณ์ CCTV ที่จุดสำคัญภายในและโดยรอบสถานที่ อาคารและพื้นที่ต่างๆ ของเรา
                     ยกเว้นบางพื้นที่ เช่น ห้องสุขา
                     <br />
                     2.3 ระบบ CCTV ของเราเปิดใช้งานตลอด 24 ชั่วโมง
                     โดยจะมีเจ้าหน้าที่รักษาความปลอดภัยของเราทำการเฝ้าดูผ่านอุปกรณ์
                     ยกเว้นในกรณีที่อุปกรณ์/ระบบเกิดความขัดข้อง และ/หรือต้องทำการซ่อมบำรุง
                     <br />
                     2.4 เราจะจัดวางป้ายตามความเหมาะสมในสถานที่ที่มีการใช้งานระบบ CCTV
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">3. บุคคลใดที่อาจได้รับการเปิดเผยข้อมูลส่วนบุคคลของท่าน</b><br />
                     3.1 เราจะเก็บข้อมูลส่วนบุคคลที่เกี่ยวข้องกับท่านในระบบ CCTV ไว้เป็นความลับ
                     และจะทำการเปิดเผยหรือถ่ายโอนข้อมูลส่วนบุคคลดังกล่าวเฉพาะเพียงบริษัทลูก บริษัทในเครือของเรา
                     บุคคลภายนอกอื่นๆ ที่จะถูกคัดเลือกอย่างระมัดระวังในเวลานี้หรือในอนาคต ผู้ได้รับอนุญาต
                     พันธมิตรกิจการร่วมค้า และ/หรือผู้ให้บริการ (ซึ่งอาจตั้งอยู่ในต่างประเทศ)
                     เพื่อให้บรรลุวัตถุประสงค์การตรวจสอบโดย CCTV ตามที่ระบุไว้ในนโยบายนี้
                     <br />
                     3.2 บุคคลภายนอกซึ่งเราอาจเปิดเผยข้อมูลจากระบบ CCTV และข้อมูลส่วนบุคคลอื่นๆ ที่เกี่ยวข้องกับท่าน
                     ซึ่งรวมถึงการเปิดเผยต่อบริษัทในเครือของเรา
                     (เป็นส่วนหนึ่งของประโยชน์โดยชอบด้วยกฎหมายของเราและประโยชน์ของบริษัทในเครือของเรา
                     เพื่อให้บรรลุวัตถุประสงค์การตรวจสอบโดย CCTV) หน่วยงานภาครัฐ และ/หรือองค์กรที่ทำหน้าที่กำกับดูแล
                     (เพื่อปฏิบัติตามหน้าที่ตามกฎหมาย
                     หรือเพื่อสนับสนุนหรือช่วยเหลือแก่องค์กรบังคับใช้กฎหมายในเรื่องการสอบสวนและดำเนินคดีทางแพ่งหรือทางอาญา)
                     และผู้ให้บริการบุคคลที่สาม (ตามขั้นตอนที่จำเป็นของเราเพื่อให้แน่ใจว่า
                     เราจะให้การคุ้มครองต่อสุขภาพและความปลอดภัยส่วนบุคคล และทรัพย์สินของท่าน)
                     อย่างไรก็ตามการเข้าถึงข้อมูลระบบ CCTV นั้น
                     อาจเป็นการเข้าถึงหรือเปิดเผยได้เท่าที่จำเป็นเพื่อจัดการกับเหตุการณ์ที่เกิดขึ้นซึ่งอยู่ภายใต้หนึ่งในวัตถุประสงค์ที่ระบุไว้ในข้อ
                     3.2 นี้ หรือเพื่อตอบสนองการร้องขอของบุคคลตามกฎหมายภายใต้ข้อ 2.1
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">4. การส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปยังต่างประเทศ </b><br />
                     เราอาจเปิดเผยหรือถ่ายโอนข้อมูลส่วนบุคคลของท่านจากระบบ CCTV
                     (ซึ่งเป็นส่วนหนึ่งของขั้นตอนที่จำเป็นสำหรับสุขภาพ ความปลอดภัยส่วนบุคคลและทรัพย์สินของท่าน)
                     ไปยังผู้ให้บริการบุคคลที่สามที่อยู่นอกประเทศไทย
                     และการเปิดเผยหรือถ่ายโอนดังกล่าวจะกระทำต่อเมื่อได้รับความยินยอมจากท่าน
                     หรือมีพื้นฐานตามกฎหมายอื่นที่บังคับให้กระทำตามที่กฎหมายอนุญาตไว้
                     (เช่นเพื่อปฏิบัติตามข้อกำหนดของสัญญาระหว่างเรากับบุคคลอื่นเพื่อประโยชน์ของท่าน)
                     โดยที่ประเทศปลายทางดังกล่าวอาจมีหรือไม่มีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลที่คล้ายคลึงกับประเทศไทย
                     อย่างไรก็ตาม
                     เราจะทำให้มั่นใจได้ว่าการโอนข้อมูลส่วนบุคคลของท่านได้กระทำตามกฎหมายเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลแล้วก่อนจะดำเนินการโอนข้อมูลส่วนบุคคลนั้น
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">5. มาตรการรักษาความปลอดภัย</b><br />
                     5.1 เราจะจัดให้มีระบบเทคนิค และการบริหารจัดการมาตรการรักษาความปลอดภัยที่เหมาะสม
                     เพื่อป้องกันข้อมูลจากระบบ CCTV และข้อมูลส่วนบุคคลที่เกี่ยวข้องกับท่านจากการถูกทำลาย การสูญหาย
                     การเข้าถึง การใช้งาน การเปลี่ยนแปลง หรือการเปิดเผย โดยไม่ได้ตั้งใจ โดยผิดกฎหมาย
                     หรือโดยไม่ได้รับอนุญาต
                     <br />
                     5.2 เราจะทบทวนและปรับปรุงมาตรการรักษาความปลอดภัยของเราเป็นครั้งคราวตามความจำเป็น
                     หรือเมื่อมีการพัฒนาเทคโนโลยีที่เกี่ยวข้อง
                     เพื่อให้มั่นใจว่ามาตรการรักษาความปลอดภัยมีประสิทธิภาพและเหมาะสม สอดคล้องกับข้อกำหนดทางกฎหมายขั้นต่ำ
                     ตามที่กำหนดโดยหน่วยงานของรัฐที่เกี่ยวข้อง
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">6. ระยะเวลาในการที่เราเก็บข้อมูลส่วนบุคคลของท่าน</b><br />
                     เราจะเก็บข้อมูลส่วนบุคคลของท่านที่เราได้มาจากระบบ CCTV
                     ไว้ในระบบของเราตามระยะเวลาเท่าที่จำเป็นเพื่อให้บรรลุวัตถุประสงค์การตรวจสอบโดย CCTV
                     หากเราไม่ได้รับอนุญาตตามกฎหมายที่ใช้บังคับในการจัดเก็บข้อมูลส่วนบุคคลของท่านจากระบบ CCTV อีกต่อไป
                     เราจะทำการลบข้อมูลเหล่านั้นออกจากระบบและการบันทึกของเรา
                     อย่างไรก็ตามเราอาจทำการเก็บข้อมูลส่วนบุคคลของท่านจากระบบ CCTV เป็นระยะเวลานานขึ้น ตัวอย่างเช่น
                     ทำการเก็บไว้จนกว่าจะสิ้นสุดของการดำเนินการตามกฎหมาย
                     หรือมีกฎหมายที่กำหนดระยะเวลาในการเก็บข้อมูลที่ยาวนานกว่า หรือมีข้อมูลระบบ CCTV
                     บางอย่างซึ่งต้องทำการเก็บรักษาไว้สำหรับการดำเนินการต่อเหตุการณ์บางเรื่อง
                     หรือเพื่อตอบสนองต่อข้อเรียกร้องจากบุคคลหนึ่งบุคคลใดในการใช้สิทธิตามกฎหมาย
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">7. ท่านมีสิทธิอย่างไรเกี่ยวกับข้อมูลส่วนบุคคลของท่าน</b><br />
                     ภายใต้บทบัญญัติแห่งกฎหมายและข้อยกเว้นตามกฎหมายที่เกี่ยวข้อง ท่านอาจมีสิทธิในการขอเข้าถึง
                     และ/หรือขอรับสำเนา โอนย้าย แก้ไข ลบ ทำลาย
                     หรือทำให้ข้อมูลกลายเป็นข้อมูลที่ไม่ระบุตัวตนในข้อมูลส่วนบุคคล บางประเภทของท่านที่เรามี
                     ระงับและ/หรือคัดค้านกิจกรรมบางประเภทที่เรามีและใช้ข้อมูลส่วนบุคคลของท่าน
                     ในกรณีที่การดำเนินการใดของเรากระทำภายใต้ความยินยอมของท่าน ท่านอาจเพิกถอนความยินยอมของท่านได้
                     แต่อาจเป็นสาเหตุให้เราไม่สามารถให้บริการของเราแก่ท่านได้อย่างเต็มที่
                     ท่านอาจมีสิทธิร้องขอให้เราเปิดเผยว่าเราได้รับข้อมูลส่วนบุคคลของท่านโดยไม่ได้รับความยินยอมจากท่านได้อย่างไร
                     อีกทั้งยังอาจยื่นเรื่องร้องเรียนไปยังหน่วยงานที่มีอำนาจตามกฎหมายที่บังคับใช้
                  </p>
               </div>
               <div class="col-12">
                  <p class="font-thai">
                     <b class="font-thai">8. รายละเอียดการติดต่อเรา</b><br />
                     หากท่านมีข้อซักถามหรือข้อสงสัยประการใด หรือมีความประสงค์ที่จะสิทธิของท่านเกี่ยวกับข้อมูลระบบ CCTV
                     โปรดติดต่อเราหรือเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเรา ที่
                     <br />
                     <br />
                     บริษัท เอส เอ็น ซี ฟอร์เมอร์ จำกัด (มหาชน)(สำนักงานใหญ่)<br />
                     333/3 หมู่ที่ 6 ตำบลบางเพรียง อำเภอบางบ่อ จังหวัดสมุทรปราการ 10560
                     Tel. (662) 108-0370 – 76 , E-mail : snc@sncformer.com
                     <br />
                     <br />
                     เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล<br />
                     คุณพรชัย ศิริกิจพาณิชย์กูล<br />
                     333/3 หมู่ที่ 6 ตำบลบางเพรียง อำเภอบางบ่อ จังหวัดสมุทรปราการ 10560
                     Tel. (662) 108-0370 – 76 , E-mail : Pornchai@sncformer.com
                  </p>
               </div>
            </div>
         </div>
      </div>
   </div>
</div>

<!-- Confirm Modal -->
<div class="modal fade" id="confirmModal" data-bs-backdrop="static" data-bs-keyboard="false" tabindex="-1" aria-labelledby="staticBackdropLabel" aria-hidden="true">
   <div class="modal-dialog modal-dialog-centered modal-dialog-scrollable modal-lg">
      <div class="modal-content">
         <div class="modal-header">
            <h4 class="modal-title font-thai fw-bold" id="staticBackdropLabel">ยืนยันการบันทึกข้อมูล
               <span>(Confirm Information)</span>
            </h4>
            <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
         </div>
         <div class="modal-body" style="height: 55vh">
            <div class="row">
               <div class="col-12">
                  <p class="font-thai">
                     ข้าพเจ้าขอรับรองว่าข้อมูลที่ระบุข้างต้นถูกต้องและเป็นความจริงทุกประการ ทั้งนี้
                     หากปรากฏเป็นเท็จข้าพเจ้าขอรับผิดตามกฎหมาย และรับผิดชอบความเสียหายที่เกิดขึ้น
                     โดยให้ถือเอกสารนี้เป็นหลักฐานในชั้นศาลได้<br />
                     <span>
                        (I certify that the information are true and correct to the best of my knowledge.
                        I understand that in the event of my information being found false or incorrect
                        at any stage, I shall be liable for any loss or damages incurred. This document
                        may be used as an evidence in the court.)
                     </span>
                  </p>
               </div>

               <!-- Details -->
               <div class="row  m-0 align-items-center ">
                  <div class="col-1 d-flex align-items-center justify-content-end">
                     <i class="fas fa-circle fa-xs me-3"></i>
                  </div>
                  <div class="col-8 ">
                     <p class="font-thai fw-bold pt-3">นโยบายความเป็นส่วนตัวการใช้งานเว็บไซต์ <br /><span>
                           ( Website privacy policy.)
                        </span></p>
                  </div>
                  <div class="col-3">
                     <a href="https://www.sncformer.com/th/privacy-policy" target="_blank" class="btn btn-sm btn-secondary font-thai text-nowrap">รายละเอียด</a>
                     <!-- <button type="button" class="btn btn-sm btn-secondary font-thai text-nowrap" data-bs-toggle="modal" data-bs-target="#personalModal">รายละเอียด</button> -->
                  </div>
                  <div class="col-1 d-flex align-items-center justify-content-end">
                     <i class="fas fa-circle fa-xs me-3"></i>
                  </div>
                  <div class="col-8 ">
                     <p class="font-thai fw-bold pt-3">นโยบายความเป็นส่วนตัวในการใช้งานกล้องวงจรปิด (CCTV) <br /><span>
                           ( CCTV privacy policy.)
                        </span></p>
                  </div>
                  <div class="col-3">
                     <a href="https://me-qr.com/th/mobile/pdf/7410588" target="_blank" class="btn btn-sm btn-secondary font-thai text-nowrap">รายละเอียด</a>
                     <!-- <button type="button" class="btn btn-sm btn-secondary font-thai text-nowrap" data-bs-toggle="modal" data-bs-target="#CCTVModal">รายละเอียด</button> -->
                  </div>
                  <div class="col-1 d-flex align-items-center justify-content-end">
                     <i class="fas fa-circle fa-xs me-3"></i>
                  </div>
                  <div class="col-8 ">
                     <p class="font-thai fw-bold pt-3">นโยบายการใช้คุกกี้ <br /><span>
                           ( Cookies policy.)
                        </span></p>
                  </div>
                  <div class="col-3">
                     <a href="https://www.sncformer.com/th/cookies-policy" target="_blank" class="btn btn-sm btn-secondary font-thai text-nowrap">รายละเอียด</a>
                  </div>
               </div>

               <!-- Check Box -->
               <div class=" col-12 pt-3">
                  <div class="row">
                     <div class="col-1 text-end ">
                        <input v-model="chkAdmit1" class="form-check-input" type="checkbox" id="checkBox1">
                     </div>
                     <div class="col-11">
                        <label class="form-check-label font-thai ps-2" for="checkBox1">
                           ข้าพเจ้ายอมรับนโยบายความเป็นส่วนตัวการใช้งานเว็บไซต์
                        </label>
                     </div>
                     <div class="col-1 text-end ">
                        <input v-model="chkAdmit2" class="form-check-input" type="checkbox" id="checkBox2">
                     </div>
                     <div class="col-11">
                        <label class="form-check-label font-thai ps-2" for="checkBox2">
                           ข้าพเจ้ายอมรับนโยบายความเป็นส่วนตัวในการใช้งานกล้องวงจรปิด (CCTV)
                        </label>
                     </div>
                     <div class="col-1 text-end ">
                        <input v-model="chkAdmit3" class="form-check-input" type="checkbox" id="checkBox3">
                     </div>
                     <div class="col-11">
                        <label class="form-check-label font-thai ps-2" for="checkBox3">
                           ข้าพเจ้ายอมรับนโยบายการใช้คุกกี้
                        </label>
                     </div>
                  </div>
               </div>
            </div>
         </div>

         <div class="modal-footer">
            <p v-if="confirm" class="font-thai text-danger">โปรดระบุข้อมูลให้ครบถ้วน</p>
            <button class="btn btn-success rounded-pill font-thai" @click="handleConfirm()" data-bs-dismiss="modal" :disabled="confirm || !chkAdmit1 || !chkAdmit2 || !chkAdmit3">ยืนยัน
               <span>(Confirm)</span></button>
            <button type="button" class="btn btn-danger rounded-pill font-thai" data-bs-dismiss="modal">ยกเลิก
               <span>(Cancel)</span></button>
         </div>
      </div>
   </div>
</div>
</div>